[command]/home/ubuntu/actions-runner/_work/_temp/046efff4-0f0d-4ec8-bdd0-5788e8e05cff/terraform-bin plan -input=false -no-color Refreshing Terraform state in-memory prior to plan... The refreshed state will be used to calculate this plan, but will not be persisted to local or remote state storage. ------------------------------------------------------------------------ An execution plan has been generated and is shown below. Resource actions are indicated with the following symbols: + create Terraform will perform the following actions: # aws_s3_bucket.b will be created + resource "aws_s3_bucket" "b" { + acceleration_status = (known after apply) + acl = "private" + arn = (known after apply) + bucket = "my-tf-test-bucket1" + bucket_domain_name = (known after apply) + bucket_regional_domain_name = (known after apply) + force_destroy = false + hosted_zone_id = (known after apply) + id = (known after apply) + region = (known after apply) + request_payer = (known after apply) + tags = { + "Environment" = "Dev" + "Name" = "My bucket" } + tags_all = { + "Environment" = "Dev" + "Name" = "My bucket" } + website_domain = (known after apply) + website_endpoint = (known after apply) + versioning { + enabled = (known after apply) + mfa_delete = (known after apply) } } Plan: 1 to add, 0 to change, 0 to destroy. ------------------------------------------------------------------------ Note: You didn't specify an "-out" parameter to save this plan, so Terraform can't guarantee that exactly these actions will be performed if "terraform apply" is subsequently run. ::debug::Terraform exited with code 0. ::debug::stdout: Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
 + create

Terraform will perform the following actions:

 # aws_s3_bucket.b will be created
 + resource "aws_s3_bucket" "b" {
 + acceleration_status = (known after apply)
 + acl = "private"
 + arn = (known after apply)
 + bucket = "my-tf-test-bucket1"
 + bucket_domain_name = (known after apply)
 + bucket_regional_domain_name = (known after apply)
 + force_destroy = false
 + hosted_zone_id = (known after apply)
 + id = (known after apply)
 + region = (known after apply)
 + request_payer = (known after apply)
 + tags = {
 + "Environment" = "Dev"
 + "Name" = "My bucket"
 }
 + tags_all = {
 + "Environment" = "Dev"
 + "Name" = "My bucket"
 }
 + website_domain = (known after apply)
 + website_endpoint = (known after apply)

 + versioning {
 + enabled = (known after apply)
 + mfa_delete = (known after apply)
 }
 }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ::debug::stderr: ::debug::exitcode: 0 ::set-output name=stdout::Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
 + create

Terraform will perform the following actions:

 # aws_s3_bucket.b will be created
 + resource "aws_s3_bucket" "b" {
 + acceleration_status = (known after apply)
 + acl = "private"
 + arn = (known after apply)
 + bucket = "my-tf-test-bucket1"
 + bucket_domain_name = (known after apply)
 + bucket_regional_domain_name = (known after apply)
 + force_destroy = false
 + hosted_zone_id = (known after apply)
 + id = (known after apply)
 + region = (known after apply)
 + request_payer = (known after apply)
 + tags = {
 + "Environment" = "Dev"
 + "Name" = "My bucket"
 }
 + tags_all = {
 + "Environment" = "Dev"
 + "Name" = "My bucket"
 }
 + website_domain = (known after apply)
 + website_endpoint = (known after apply)

 + versioning {
 + enabled = (known after apply)
 + mfa_delete = (known after apply)
 }
 }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ::set-output name=stderr:: ::set-output name=exitcode::0